# This modulo dataset + memory optimization

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype(bool)
df["Gender"] = df["Gender"].astype("category")
df["Team"] = df["Team"].astype("category")
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-08-14 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-08-14 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-08-14 16:47:00,101004,1.389,True,Client Services

# Filter a DataFrame based on a condition

## With a funky syntax

In [3]:
df[df["Gender"] == "Male"]  # extracting all rows with gender == "male"

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-08-14 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-08-14 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-08-14 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-08-14 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-08-14 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2022-08-14 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-08-14 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-08-14 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-08-14 18:24:00,129949,10.169,True,Sales

In [4]:
df[df["Team"] == "Finance"]  # df with all rows corresponding to team finance

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,2022-08-14 10:43:00,45906,11.598,True,Finance
14,Kimberly,Female,1999-01-14,2022-08-14 07:13:00,41426,14.543,True,Finance
46,Bruce,Male,2009-11-28,2022-08-14 22:47:00,114796,6.796,False,Finance
...,...,...,...,...,...,...,...,...
907,Elizabeth,Female,1998-07-27,2022-08-14 11:12:00,137144,10.081,False,Finance
954,Joe,Male,1980-01-19,2022-08-14 16:06:00,119667,1.148,True,Finance
987,Gloria,Female,2014-12-08,2022-08-14 05:08:00,136709,10.331,True,Finance
992,Anthony,Male,2011-10-16,2022-08-14 08:35:00,112769,11.625,True,Finance
996,Phillip,Male,1984-01-31,2022-08-14 06:30:00,42392,19.675,False,Finance

## There is a more elegant way to do this
And we can even combine conditions.

In [5]:
condition = df["Team"] == "Finance"
df[condition]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,2022-08-14 10:43:00,45906,11.598,True,Finance
14,Kimberly,Female,1999-01-14,2022-08-14 07:13:00,41426,14.543,True,Finance
46,Bruce,Male,2009-11-28,2022-08-14 22:47:00,114796,6.796,False,Finance
...,...,...,...,...,...,...,...,...
907,Elizabeth,Female,1998-07-27,2022-08-14 11:12:00,137144,10.081,False,Finance
954,Joe,Male,1980-01-19,2022-08-14 16:06:00,119667,1.148,True,Finance
987,Gloria,Female,2014-12-08,2022-08-14 05:08:00,136709,10.331,True,Finance
992,Anthony,Male,2011-10-16,2022-08-14 08:35:00,112769,11.625,True,Finance
996,Phillip,Male,1984-01-31,2022-08-14 06:30:00,42392,19.675,False,Finance

## Extracting a boolean

In [6]:
condition = df["Senior Management"] != True
df[condition]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
5,Dennis,Male,1987-04-18,2022-08-14 01:35:00,115163,10.125,False,Legal
13,Gary,Male,2008-01-27,2022-08-14 23:40:00,109831,5.831,False,Sales
15,Lillian,Female,2016-06-05,2022-08-14 06:09:00,59414,1.256,False,Product
16,Jeremy,Male,2010-09-21,2022-08-14 05:56:00,90370,7.369,False,Human Resources
...,...,...,...,...,...,...,...,...
989,Justin,NaN,1991-02-10,2022-08-14 16:58:00,38344,3.794,False,Legal
995,Henry,NaN,2014-11-23,2022-08-14 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-08-14 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-08-14 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-08-14 16:45:00,60500,11.985,False,Business Development

In [7]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-08-14 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-08-14 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-08-14 16:47:00,101004,1.389,True,Client Services

In [8]:
# Select all rows with salary above 110000
above_11e4 = df["Salary"] >= 11e4
df[above_11e4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
5,Dennis,Male,1987-04-18,2022-08-14 01:35:00,115163,10.125,False,Legal
9,Frances,Female,2002-08-08,2022-08-14 06:51:00,139852,7.524,True,Business Development
12,Brandon,Male,1980-12-01,2022-08-14 01:08:00,112807,17.492,True,Human Resources
...,...,...,...,...,...,...,...,...
987,Gloria,Female,2014-12-08,2022-08-14 05:08:00,136709,10.331,True,Finance
991,Rose,Female,2002-08-25,2022-08-14 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-08-14 08:35:00,112769,11.625,True,Finance
995,Henry,NaN,2014-11-23,2022-08-14 06:09:00,132483,16.655,False,Distribution
999,Albert,Male,2012-05-15,2022-08-14 18:24:00,129949,10.169,True,Sales

In [9]:
prior_to_85 = df["Start Date"] <= "1985-01-01"
df[prior_to_85]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2022-08-14 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2022-08-14 01:08:00,112807,17.492,True,Human Resources
18,Diana,Female,1981-10-23,2022-08-14 10:27:00,132940,19.082,False,Client Services
28,Terry,Male,1981-11-27,2022-08-14 18:30:00,124008,13.464,True,Client Services
37,Linda,Female,1981-10-19,2022-08-14 20:49:00,57427,9.557,True,Client Services
...,...,...,...,...,...,...,...,...
982,Rose,Female,1982-04-06,2022-08-14 10:43:00,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,2022-08-14 22:35:00,146907,11.738,False,Engineering
985,Stephen,NaN,1983-07-10,2022-08-14 20:10:00,85668,1.909,False,Legal
986,Donna,Female,1982-11-26,2022-08-14 07:04:00,82871,17.999,False,Marketing
996,Phillip,Male,1984-01-31,2022-08-14 06:30:00,42392,19.675,False,Finance

# Filter with More than One Condition (AND)

In [10]:
# Filter data in which gender is female and team is marketing
female = df["Gender"] == "Female"
marketing = df["Team"] == "Marketing"
df[female & marketing]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
43,Marilyn,Female,1980-12-07,2022-08-14 03:16:00,73524,5.207,True,Marketing
62,NaN,Female,2007-06-12,2022-08-14 17:25:00,58112,19.414,True,Marketing
98,Tina,Female,2016-06-16,2022-08-14 19:47:00,100705,16.961,True,Marketing
140,Shirley,Female,1981-02-28,2022-08-14 13:23:00,113850,1.854,False,Marketing
158,Norma,Female,1999-02-28,2022-08-14 20:45:00,114412,8.756,True,Marketing
201,Kimberly,Female,1997-07-15,2022-08-14 05:57:00,36643,7.953,False,Marketing
220,NaN,Female,1991-06-17,2022-08-14 12:49:00,71945,5.560,True,Marketing
305,Margaret,Female,1993-02-06,2022-08-14 13:05:00,125220,3.733,False,Marketing
319,Jacqueline,Female,1981-11-25,2022-08-14 15:01:00,145988,18.243,False,Marketing
331,Evelyn,Female,1983-09-03,2022-08-14 13:58:00,36759,17.269,True,Marketing
379,NaN,Female,2002-09-18,2022-08-14 12:39:00,118906,4.537,True,Marketing
446,Cheryl,Female,1994-08-16,2022-08-14 08:33:00,67150,15.850,True,Marketing
468,Janice,Female,1997-06-28,2022-08-14 13:48:00,136032,10.696,True,Marketing
490,Judith,Female,2007-11-23,2022-08-14 13:22:00,117055,7.461,False,Marketing
531,Virginia,Female,2010-05-02,2022-08-14 21:10:00,123649,10.154,True,Marketing
535,Louise,Female,1981-09-18,2022-08-14 05:47:00,91462,8.205,False,Marketing
568,Susan,Female,1986-04-18,2022-08-14 09:31:00,90829,19.142,False,Marketing
585,Shirley,Female,1988-04-16,2022-08-14 11:09:00,132156,2.754,False,Marketing
586,Rose,Female,2004-10-30,2022-08-14 16:34:00,56961,7.585,False,Marketing
617,Kathy,Female,2001-01-14,2022-08-14 05:11:00,45682,1.451,True,Marketing
625,Cynthia,Female,2015-06-29,2022-08-14 06:38:00,82408,8.701,True,Marketing
627,Anne,Female,1984-11-21,2022-08-14 12:30:00,128305,16.636,False,Marketing
629,Debra,Female,1983-03-12,2022-08-14 12:19:00,74911,19.513,False,Marketing
656,Lisa,Female,1982-02-09,2022-08-14 18:44:00,113592,17.108,True,Marketing
675,Diane,Female,2009-10-30,2022-08-14 18:56:00,130577,12.791,False,Marketing
676,Annie,Female,1992-06-06,2022-08-14 10:04:00,138925,9.801,True,Marketing
730,Nicole,Female,2009-04-26,2022-08-14 00:40:00,66047,18.674,True,Marketing
785,NaN,Female,1982-07-24,2022-08-14 00:00:00,57811,8.941,True,Marketing
811,Judith,Female,1989-09-03,2022-08-14 11:16:00,134048,6.818,True,Marketing
813,Evelyn,Female,2002-02-10,2022-08-14 04:44:00,123621,19.767,True,Marketing
817,Ruby,Female,2008-05-31,2022-08-14 20:41:00,83112,4.083,False,Marketing
824,Julia,Female,2014-08-18,2022-08-14 03:12:00,97566,2.147,False,Marketing
881,Ruby,Female,1980-01-28,2022-08-14 23:08:00,142868,6.318,False,Marketing
883,Kathryn,Female,1995-10-27,2022-08-14 15:39:00,57300,18.015,False,Marketing
894,Betty,Female,2002-11-19,2022-08-14 10:40:00,37005,7.645,True,Marketing
913,Lois,Female,2015-12-11,2022-08-14 16:10:00,99747,6.168,False,Marketing
930,Nancy,Female,2001-09-10,2022-08-14 23:57:00,85213,2.386,True,Marketing
942,Lori,Female,2015-11-20,2022-08-14 13:15:00,75498,6.537,True,Marketing
986,Donna,Female,1982-11-26,2022-08-14 07:04:00,82871,17.999,False,Marketing
991,Rose,Female,2002-08-25,2022-08-14 05:12:00,134505,11.051,True,Marketing

# Filter with More than One Condition (OR)

In [11]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-08-14 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-08-14 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-08-14 16:47:00,101004,1.389,True,Client Services

In [12]:
senior = df["Senior Management"]
start_date = df["Start Date"] <= "1990-01-01"
# check is at least a condition is true
df[senior | start_date]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-08-14 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-08-14 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-08-14 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-08-14 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
992,Anthony,Male,2011-10-16,2022-08-14 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2022-08-14 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2022-08-14 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2022-08-14 06:30:00,42392,19.675,False,Finance
999,Albert,Male,2012-05-15,2022-08-14 18:24:00,129949,10.169,True,Sales

In [13]:
# we can combine more than two conditions.
# check if first_name == Robert AND team == Client Services
# OR start date greater than 1st june 2016

name = df["First Name"] == "Robert"
team = df["Team"] == "Client Services"
start_date = df["Start Date"] >= "2016-06-01"
df[(name & team) | start_date]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2022-08-14 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2022-08-14 19:47:00,100705,16.961,True,Marketing
387,Robert,Male,1994-10-29,2022-08-14 04:26:00,123294,19.894,False,Client Services
451,Terry,NaN,2016-07-15,2022-08-14 00:29:00,140002,19.490,True,Marketing

In [ ]:
df.head()

# Check for inclusion with `.isin()` method

In [ ]:
mask = df["Team"].isin(["Legal", "Sales", "Product"])
df[mask]

# The `.isnull()` and `.notnull()` methods

In [ ]:
df["Team"].isnull()

In [ ]:
df["Gender"].notnull()

# The `.between()` method

In [ ]:
df.head()

In [ ]:
df["Salary"].between(left=6e4, right=7e4, inclusive="both")  # include both by default

In [ ]:
df["Bonus %"].between(2.0, 5.0)

In [ ]:
df[df["Start Date"].between("1991-01-01", "1991-12-31")]

In [ ]:
df[df["Last Login Time"].between("8:30AM", "12:00PM")]

# Check for duplicated rows with `.duplicated()`

In [ ]:
df.sort_values(by="First Name", inplace=True)
df.head()

In [ ]:
mark = ~df[
    "First Name"
].duplicated()  # to negate a condition in pandas we use the ~ symbol
df[mark]

# Remove duplicates with `drop_duplicates()`

In [ ]:
df.head()

In [ ]:
df.drop_duplicates(subset=["First Name", "Team"], keep=False)

# The `unique()` and `nunique()` methods

In [ ]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype(bool)
df["Gender"] = df["Gender"].astype("category")
df["Team"] = df["Team"].astype("category")
df.head()

In [ ]:
len(df["Gender"].unique())

In [ ]:
len(df["Team"].unique())

In [ ]:
df["Gender"].nunique(dropna=False)

In [ ]:
df["Team"].nunique(dropna=False)

# Check for inclusion with `.isin()` method

In [15]:
mask = df["Team"].isin(["Legal", "Sales", "Product"])
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2022-08-14 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2022-08-14 16:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,2022-08-14 15:19:00,102508,12.637,True,Legal
13,Gary,Male,2008-01-27,2022-08-14 23:40:00,109831,5.831,False,Sales
15,Lillian,Female,2016-06-05,2022-08-14 06:09:00,59414,1.256,False,Product
...,...,...,...,...,...,...,...,...
981,James,Male,1993-01-15,2022-08-14 17:19:00,148985,19.280,False,Legal
985,Stephen,NaN,1983-07-10,2022-08-14 20:10:00,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,2022-08-14 16:58:00,38344,3.794,False,Legal
997,Russell,Male,2013-05-20,2022-08-14 12:39:00,96914,1.421,False,Product
999,Albert,Male,2012-05-15,2022-08-14 18:24:00,129949,10.169,True,Sales

# The `.isnull()` and `.notnull()` methods

In [16]:
df["Team"].isnull()

0      False
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: Team, Length: 1000, dtype: bool

In [17]:
df["Gender"].notnull()

0       True
1       True
2       True
3       True
4       True
       ...
995    False
996     True
997     True
998     True
999     True
Name: Gender, Length: 1000, dtype: bool

# The `.between()` method

In [18]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-08-14 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-08-14 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-08-14 16:47:00,101004,1.389,True,Client Services

In [19]:
df["Salary"].between(left=6e4, right=7e4, inclusive="both")  # include both by default

0      False
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998     True
999    False
Name: Salary, Length: 1000, dtype: bool

In [20]:
df["Bonus %"].between(2.0, 5.0)

0      False
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: Bonus %, Length: 1000, dtype: bool

In [21]:
df[df["Start Date"].between("1991-01-01", "1991-12-31")]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
27,Scott,NaN,1991-07-11,2022-08-14 18:58:00,122367,5.218,False,Legal
75,Bonnie,Female,1991-07-02,2022-08-14 01:27:00,104897,5.118,True,Human Resources
88,Donna,Female,1991-11-27,2022-08-14 13:59:00,64088,6.155,True,Legal
116,NaN,Male,1991-06-22,2022-08-14 20:58:00,76189,18.988,True,Legal
148,Patrick,NaN,1991-07-14,2022-08-14 02:24:00,124488,14.837,True,Sales
166,NaN,Female,1991-07-09,2022-08-14 18:52:00,42341,7.014,True,Sales
172,Sara,Female,1991-09-23,2022-08-14 18:17:00,97058,9.402,False,Finance
220,NaN,Female,1991-06-17,2022-08-14 12:49:00,71945,5.560,True,Marketing
245,Victor,Male,1991-04-11,2022-08-14 07:44:00,70817,17.138,False,Engineering
277,Brenda,NaN,1991-05-29,2022-08-14 06:32:00,82439,19.062,False,Sales
313,Judy,Female,1991-07-01,2022-08-14 02:33:00,109510,13.457,True,Legal
328,Samuel,Male,1991-12-19,2022-08-14 02:54:00,76076,5.319,True,Finance
339,Michael,Male,1991-11-22,2022-08-14 12:57:00,98753,16.443,True,Human Resources
537,Cynthia,Female,1991-09-14,2022-08-14 13:08:00,51633,13.472,True,Business Development
552,Barbara,Female,1991-09-02,2022-08-14 15:41:00,127297,11.905,True,Product
603,Carl,NaN,1991-10-26,2022-08-14 08:11:00,100888,12.490,True,Business Development
639,Amanda,NaN,1991-08-11,2022-08-14 14:15:00,46665,19.391,True,Client Services
704,Thomas,Male,1991-09-07,2022-08-14 09:51:00,65251,11.211,False,Distribution
725,Jeremy,Male,1991-05-19,2022-08-14 13:40:00,131513,1.876,True,Finance
766,Justin,Male,1991-07-25,2022-08-14 00:45:00,112975,9.699,False,Human Resources
771,Peter,Male,1991-05-22,2022-08-14 01:39:00,102577,12.026,True,Product
783,NaN,NaN,1991-04-15,2022-08-14 03:39:00,132505,13.592,True,Product
891,Timothy,Male,1991-08-25,2022-08-14 10:37:00,92587,8.475,False,Finance
895,Janice,NaN,1991-11-19,2022-08-14 18:02:00,139791,16.968,False,Business Development
909,Donald,Male,1991-08-01,2022-08-14 02:25:00,61999,6.466,False,Product
923,Irene,NaN,1991-02-28,2022-08-14 22:23:00,135369,4.380,False,Business Development
989,Justin,NaN,1991-02-10,2022-08-14 16:58:00,38344,3.794,False,Legal

In [22]:
df[df["Last Login Time"].between("8:30AM", "12:00PM")]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,2022-08-14 10:43:00,45906,11.598,True,Finance
10,Louise,Female,1980-08-12,2022-08-14 09:01:00,63241,15.132,True,NaN
18,Diana,Female,1981-10-23,2022-08-14 10:27:00,132940,19.082,False,Client Services
33,Jean,Female,1993-12-18,2022-08-14 09:07:00,119082,16.180,False,Business Development
...,...,...,...,...,...,...,...,...
963,Ann,Female,1994-09-23,2022-08-14 11:15:00,89443,17.940,True,Sales
977,Sarah,Female,1995-12-04,2022-08-14 09:16:00,124566,5.949,False,Product
982,Rose,Female,1982-04-06,2022-08-14 10:43:00,91411,8.639,True,Human Resources
988,Alice,Female,2004-10-05,2022-08-14 09:34:00,47638,11.209,False,Human Resources
992,Anthony,Male,2011-10-16,2022-08-14 08:35:00,112769,11.625,True,Finance

# Check for duplicated rows with `.duplicated()`

In [33]:
df.sort_values(by="First Name", inplace=True)
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2022-08-14 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2022-08-14 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2022-08-14 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2022-08-14 19:39:00,63126,18.424,False,Client Services
137,Adam,Male,2011-05-21,2022-08-14 01:45:00,95327,15.120,False,Distribution

In [47]:
mark = ~df[
    "First Name"
].duplicated()  # to negate a condition in pandas we use the ~ symbol
df[mark]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2022-08-14 10:20:00,61602,11.849,True,Marketing
137,Adam,Male,2011-05-21,2022-08-14 01:45:00,95327,15.120,False,Distribution
300,Alan,Male,1988-06-26,2022-08-14 03:54:00,111786,3.592,True,Engineering
372,Albert,Male,1997-02-01,2022-08-14 16:20:00,67827,19.717,True,Engineering
988,Alice,Female,2004-10-05,2022-08-14 09:34:00,47638,11.209,False,Human Resources
...,...,...,...,...,...,...,...,...
433,Wanda,Female,2008-07-20,2022-08-14 13:44:00,65362,7.132,True,Legal
177,Wayne,Male,2012-04-07,2022-08-14 08:00:00,102652,14.085,True,Distribution
820,William,Male,1993-11-18,2022-08-14 12:27:00,54058,5.182,True,Human Resources
450,Willie,Male,2009-08-22,2022-08-14 13:03:00,55038,19.691,False,Legal
7,NaN,Female,2015-07-20,2022-08-14 10:43:00,45906,11.598,True,Finance

# Remove duplicates with `drop_duplicates()`

In [48]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2022-08-14 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2022-08-14 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2022-08-14 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2022-08-14 19:39:00,63126,18.424,False,Client Services
137,Adam,Male,2011-05-21,2022-08-14 01:45:00,95327,15.120,False,Distribution

In [52]:
df.drop_duplicates(subset=["First Name", "Team"], keep=False)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
137,Adam,Male,2011-05-21,2022-08-14 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2022-08-14 20:57:00,110194,14.727,True,Product
300,Alan,Male,1988-06-26,2022-08-14 03:54:00,111786,3.592,True,Engineering
53,Alan,NaN,2014-03-03,2022-08-14 13:28:00,40341,17.578,True,Finance
610,Alan,Male,2012-02-17,2022-08-14 00:26:00,41453,10.084,False,Product
...,...,...,...,...,...,...,...,...
448,Wayne,Male,1992-01-30,2022-08-14 15:01:00,81183,17.066,False,Client Services
943,Wayne,Male,2006-09-08,2022-08-14 11:09:00,67471,2.728,False,Engineering
637,Wayne,Male,2009-09-02,2022-08-14 01:37:00,126956,18.396,False,Human Resources
941,William,Male,1997-06-26,2022-08-14 08:33:00,104840,15.653,True,Engineering
450,Willie,Male,2009-08-22,2022-08-14 13:03:00,55038,19.691,False,Legal

# The `unique()` and `nunique()` methods

In [55]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype(bool)
df["Gender"] = df["Gender"].astype("category")
df["Team"] = df["Team"].astype("category")
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-08-14 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-08-14 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-08-14 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-08-14 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-08-14 16:47:00,101004,1.389,True,Client Services

In [65]:
len(df["Gender"].unique())

3

In [66]:
len(df["Team"].unique())

11

In [63]:
df["Gender"].nunique(dropna=False)

3

In [64]:
df["Team"].nunique(dropna=False)

11